FKDD_COPY_DIFF_3_2026-02-13/Documents/ОтчетПрослеживаемыеТоварыОтчетОбОперациях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтчетПрослеживаемыеТоварыОтчетОбОперациях</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияУведомленияПрослеживаемостиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КодыОперацийПрослеживаемости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КППКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокРНПТ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РНПТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>29</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ОперацииПрослеживаемыхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОперацииПрослеживаемыхТоваров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПрослеживаемости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>11</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Comment>Сумма в валюте регламентированного учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтчетностьОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДокументыОтображенияОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыОперацийПрослеживаемости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателяАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализацииАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступленияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РНПТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Documents/ОтчетПрослеживаемыеТоварыОтчетОбОперациях/Ext/ObjectModule.bsl
// Модуль документа ОтчетПрослеживаемыеТоварыОтчетОбОперациях

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
//
// Возвращаемое значение:
//  Результат - соответствие.
//
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Неопределено;
	Результат=Новый Соответствие();
	Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	
	Возврат Результат;
КонецФункции // ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры()

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ПериодОтчета",1);
	ОбязательныеРеквизиты.Вставить("Состояние",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность, Истина);
	Возврат Результат;
КонецФункции // ПроверитьКорректность()

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	// Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ОтчетОбОперацияхСПрослеживаемымиТоварами","Отчет об операциях с прослеживаемыми товаровами",Истина);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="ПодразделениеКомпании" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Рез;
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
	//зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

// Заполнение отчета по учетным данным с учетом параметров
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Процедура ЗаполнитьОтчет() Экспорт
	
	// Очистим табличные части
	Операции.Очистить();
	СписокРНПТ.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Организация)
		ИЛИ НЕ ЗначениеЗаполнено(ПериодОтчета) Тогда
		// Не все параметры заполнены для получения данных
		Возврат;
	КонецЕсли;
	
	// Запрос на получение данных по регистру
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.ОтчетностьОперации КАК ОтчетностьОперации,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.КодОперации КАК КодОперации,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.Документ КАК Документ,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.Контрагент КАК Контрагент,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.Контрагент.ИНН КАК КонтрагентИНН,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.Контрагент.КПП КАК КонтрагентКПП,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.Контрагент.ФормаСобственности КАК КонтрагентФормаСобственности,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.Контрагент.Фамилия КАК КонтрагентФамилия,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.Контрагент.Имя КАК КонтрагентИмя,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.Контрагент.Отчество КАК КонтрагентОтчество,
	|	ВЫБОР
	|		КОГДА ОперацииПрослеживаемыхТоваровСрезПоследних.Номенклатура ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ОперацииПрослеживаемыхТоваровСрезПоследних.Номенклатура КАК Справочник.Номенклатура).БазоваяЕдиницаИзмерения.Код
	|		ИНАЧЕ ""796""
	|	КОНЕЦ КАК КодЕдиницыИзмерения,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.РНПТ.Наименование КАК РНПТ,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.КоличествоПрослеживаемости КАК Количество,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.СуммаБезНДС КАК Сумма,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.ВидДокумента КАК ВидДокумента,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.НомерДокумента КАК НомерДокумента,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.ДатаДокумента КАК ДатаДокумента,
	|	ОперацииПрослеживаемыхТоваровСрезПоследних.Период КАК ДатаОперации
	|ИЗ
	|	РегистрСведений.ОперацииПрослеживаемыхТоваров.СрезПоследних(
	|			,
	|			Организация = &Организация
	|				И ПериодОтчета = &ПериодОтчета) КАК ОперацииПрослеживаемыхТоваровСрезПоследних
	|ИТОГИ ПО
	|	Документ,
	|	КодОперации";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодОтчета", ПериодОтчета);
	
	ВыборкаДокумента = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокумента.Следующий() Цикл
		
		ВыборкаОперации = ВыборкаДокумента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОперации.Следующий() Цикл
			
			// Вводим новую операцию
			ИдентификаторОперации = Новый УникальныйИдентификатор;
			ЭтоПерваяСтрока = Истина;
			ВыборкаРНПТ = ВыборкаОперации.Выбрать();
			
			Пока ВыборкаРНПТ.Следующий() Цикл
				
				Если ЭтоПерваяСтрока Тогда
					// Добавим операцию в документ
					НоваяСтрокаОперации = Операции.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаОперации, ВыборкаРНПТ);
					НоваяСтрокаОперации.ВидДокумента = Перечисления.ТипыДокументов.КодВидаДокумента(ВыборкаРНПТ.ВидДокумента);
					ЗаполнитьКонтрагентаОперации(НоваяСтрокаОперации, ВыборкаРНПТ);
					НоваяСтрокаОперации.ИдентификаторСтроки = ИдентификаторОперации;
					ЭтоПерваяСтрока = Ложь;
				КонецЕсли;
				
				НоваяСтрокаРНПТ = СписокРНПТ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРНПТ, ВыборкаРНПТ);
				НоваяСтрокаРНПТ.ИдентификаторСтроки = ИдентификаторОперации;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКонтрагентаОперации(СтрокаОперации, ДанныеКонтрагента)
	
	// Заполняем данные контрагентов только юр. лиц и ИП
	ЭтоИП =(ДанныеКонтрагента.КонтрагентФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель);
	ЭтоЮрЛицо = (ДанныеКонтрагента.КонтрагентФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо);
	
	Если НЕ (ЭтоЮрЛицо ИЛИ ЭтоИП) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаОперации.ИННКонтрагента = ДанныеКонтрагента.КонтрагентИНН;
	
	Если ЭтоЮрЛицо Тогда
		СтрокаОперации.НаименованиеКонтрагента =
			?(ЗначениеЗаполнено(ДанныеКонтрагента.КонтрагентНаименованиеПолное),
				ДанныеКонтрагента.КонтрагентНаименованиеПолное,
				ДанныеКонтрагента.КонтрагентНаименование);
		СтрокаОперации.КППКонтрагента = ДанныеКонтрагента.КонтрагентКПП;
	Иначе
		Если НЕ ПустаяСтрока(ДанныеКонтрагента.КонтрагентФамилия) Тогда
			НазваниеИП = Новый Массив;
			НазваниеИП.Добавить(ДанныеКонтрагента.КонтрагентФамилия);
			Если НЕ ПустаяСтрока(ДанныеКонтрагента.КонтрагентИмя) Тогда
				НазваниеИП.Добавить(ДанныеКонтрагента.КонтрагентИмя);
			КонецЕсли;
			Если НЕ ПустаяСтрока(ДанныеКонтрагента.КонтрагентОтчество) Тогда
				НазваниеИП.Добавить(ДанныеКонтрагента.КонтрагентОтчество);
			КонецЕсли;
			НазваниеКонтрагента = СтрСоединить(НазваниеИП, " ");
		Иначе
			НазваниеКонтрагента =
				?(ЗначениеЗаполнено(ДанныеКонтрагента.КонтрагентНаименованиеПолное),
					ДанныеКонтрагента.КонтрагентНаименованиеПолное,
					ДанныеКонтрагента.КонтрагентНаименование);
		КонецЕсли;
		СтрокаОперации.НаименованиеКонтрагента = НазваниеКонтрагента;
	КонецЕсли;
	
КонецПроцедуры


#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Функция осуществляет печать произвольного документа.
	// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
	//
	// Параметры:
	//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
	//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
	//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
	//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
	//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
	//
	// Возвращаемое значение:
	//   ТабличныйДокумент	- Сформированная печатная форма
	//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

// Формирует печатную форму "Чек"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьОтчетПрослеживаемыхТоваров(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("ОтчетПрослеживаемыхТоваров");
	
	//вывод заголовка документа
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.ОтчетГод = Формат(ПериодОтчета, "ДФ=гггг");;
	ОбластьШапка.Параметры.Период = "2" + Формат(ПериодОтчета, "ДФ=к");
	ОбластьШапка.Параметры.НомерКорректировки = НомерКорректировки;
	ОбластьШапка.Параметры.НалоговыйОрган = СокрЛП(Организация.КодИМНС);
	ОбластьШапка.Параметры.НаимОрг = СокрЛП(Организация.НаименованиеПолное);
	ОбластьШапка.Параметры.ИНН = Организация.ИНН;
	ОбластьШапка.Параметры.КПП = Организация.КПП;
	
	Если Организация.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		ПоМесту = "116";
	Иначе
		ПоМесту = "214";
	КонецЕсли;
	ОбластьШапка.Параметры.ПоМесту = ПоМесту;
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	НомерСтраницы = 2;
	НомерСтраницыПред = 2;
	
	Для Каждого ТекущаяОперация Из Операции Цикл
		
		// Находим строки с РНПТ для текущей операции и вводим их
		НайденныеСтроки = СписокРНПТ.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяОперация.ИдентификаторСтроки));
		КоличествоРНПТ = 0;
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ТекущаяОперация);
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ТекущаяСтрока,, "НомерСтроки");
			
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока,ОбластьЗаголовок,, НомерСтраницы);
				
				Если НомерСтраницы <> НомерСтраницыПред Тогда
					НомерСтраницыПред = НомерСтраницы;
					КоличествоРНПТ = 0;
				ИначеЕсли КоличествоРНПТ > 0 Тогда
					// Объединить строки
					СтрокаНачала = ТабДокумент.ВысотаТаблицы - КоличествоРНПТ;
					СтрокаОкончания = ТабДокумент.ВысотаТаблицы;
					Для НомерКолонки = 2 По 10 Цикл
						ТабДокумент.Область(СтрокаНачала, НомерКолонки, СтрокаОкончания, НомерКолонки).Объединить();
					КонецЦикла;
				КонецЕсли;
				
				КоличествоРНПТ = КоличествоРНПТ + 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
	// Выведем подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	СтруктураОтбора=Новый Структура("Организация,Объект", Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(РабочаяДата,СтруктураОтбора);
	Руководитель=СтруктураСведений.Значение;
	
	Если ЗначениеЗаполнено(Руководитель) Тогда
		ОбластьПодвал.Параметры.ПрПодп = "1";
		МассивФИО = СтрРазделить(Руководитель, " ", Ложь);
		ОбластьПодвал.Параметры.ОргПодписантФамилия = СокрЛП(МассивФИО[0]);
		ОбластьПодвал.Параметры.ОргПодписантИмя = ?(МассивФИО.Количество() > 1, МассивФИО[1], "");
		Если МассивФИО.Количество() > 2 Тогда
			Отчество = "";
			Для Инд = 2 По МассивФИО.Количество() - 1 Цикл
				Отчество = Отчество + МассивФИО[Инд];
			КонецЦикла;
			ОбластьПодвал.Параметры.ОргПодписантОтчество = Отчество;
		КонецЕсли;
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ДатаПодписи = Формат(Дата, "ДЛФ=D");
	ТабДокумент.Вывести(ОбластьПодвал);
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Возврат ТабДокумент;
КонецФункции // ПечатьЧек()

#КонецЕсли

// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание)
	
	Рез=дкОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	Если ЭтоНовый() Тогда
		Состояние = Перечисления.СостоянияУведомленияПрослеживаемостиТоваров.Новый;
		ПериодОтчета = НачалоКвартала(НачалоКвартала(ТекущаяДатаСеанса()) - 1);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, Режим)
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПрава;
#КонецЕсли
